Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་གཉིས་ཕན་ཚུན་འགྲན་པར་གྱུར་ནས་རྒྱལ་པོའི་དྲུང་དུ་དོང་སྟེ་དེའི་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་གཅིག་གིས་སྨྲས་པ།
en: “Competing with each other, they went to the king and threw themselves at the king’s feet.

source: ལྷ་བདག་ནི་བཟོ་ལེགས་པར་འཚལ་ཏོ།
en: One said, ‘Your Majesty, I know art well.’

source: །ཅིག་ཤོས་ཀྱིས་ཀྱང་སྨྲས་པ། ལྷ་བདག་ནི་དེ་བས་ཀྱང་ལྷག་པར་ལེགས་པར་འཚལ་ཏོ།
en: “ ‘Your Majesty,’ the other retorted, ‘I know it much better than him.’

source: །རྒྱལ་པོས་དེ་གཉིས་ལ་སྒོ་ཁང་བསྟན་ནས་ཁྱེད་གཉིས་གང་མཁས་ནི་ངས་མི་ཤེས་མོད་ཀྱི།
en: “The king showed them the gateway building and said, ‘I do not know which of you two is more skilled.

source: འོན་ཀྱང་གཅིག་གིས་ནི་རྩིག་ངོས་གཅིག་ལ་བྲིས་ལ། ཅིག་ཤོས་ཀྱིས་ཀྱང་གཅིག་ལ་བྲིས་ཤིག་དང་། དེ་ལྟ་ན་ཁྱེད་ཅག་གཉིས་གང་བཟོ་ལེགས་པར་ཤེས་པ་ངས་ལེགས་པར་ཤེས་པར་འགྱུར་རོ།
en: One of you should paint on one wall, and the other on another, and then I will clearly realize which of you two knows art better.’

source: །དེ་གཉིས་ཀྱི་བར་ཡོལ་བས་བཅད་ནས་རི་མོ་བྲི་བར་བརྩམས་ཏེ།
en: “A curtain was put up between the two men as a partition, and they undertook to paint.

source: དེ་ལ་གཅིག་གིས་ནི་ཟླ་བ་དྲུག་གིས་རི་མོའི་ལས་ཟིན་ཏོ།
en: One of them finished his painting in six months.

source: །ཅིག་ཤོས་ཀྱིས་ནི་ཟླ་བ་དྲུག་ཏུ་རྩིག་ངོས་བསྟར་ཏོ།
en: The other just polished the wall for six months.

source: །རི་མོའི་ལས་ཟིན་པ་གང་ཡིན་པ་དེ་རྒྱལ་པོའི་དྲུང་དུ་སོང་སྟེ་སོན་པ་དང་། སྨྲས་པ།
en: The one who had finished his painting went to the king and said, ‘Your Majesty, my painting is finished.

source: ལྷ་བདག་གི་རི་མོའི་ལས་བགྱིས་ལགས་ན་སྤྱ་ང་བྲིམ་དུ་གསོལ།
en: Please examine it.’

source: དེ་ནས་རྒྱལ་པོ་བློན་པོ་དང་ལྷན་ཅིག་སྒོར་བྱུང་ནས་མཐོང་བ་དང་། རི་མོའི་ལས་མཁས་སོ་ཞེས་ཤིན་ཏུ་མགུའོ།
en: “Then the king with some ministers went out the door and looked at the painting. ‘What a skillful painter!’ he exclaimed, much delighted.

source: །ཅིག་ཤོས་ཀྱིས་ཀྱང་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་སྨྲས་པ། ད་བདག་གི་རི་མོའི་ལས་ལ་གཟིགས་སུ་གསོལ།
en: “The other one also threw himself at the king’s feet and said, ‘Now, please look at my painting.’

source: དེས་བར་ཆད་ཀྱི་ཡོལ་བ་བཤུས་དང་། གཅིག་གི་གཟུགས་བརྙན་དེ་ལ་ཤར་བ་རྒྱལ་པོས་མཐོང་ནས་རི་མོའི་ལས་ལ་ལྷག་པར་འདི་མཁས་སོ་ཞེས་ཤིན་ཏུ་ཡ་མཚན་སྐྱེས་སོ།
en: “He opened the curtain. The king saw reflections appearing there. ‘This one is much more skilled in painting,’ he said, with great astonishment.

source: །དེ་ནས་དེས་སླར་ཡོལ་བས་བར་བཅད་ནས་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་སྨྲས་པ། ལྷ་འདི་ནི་རི་མོའི་ལས་མ་ལགས་ཏེ། འོན་ཀྱང་རྩིག་ངོས་བསྟར་བ་ལགས་སོ།
en: “Then the painter closed the curtain again, threw himself at the king’s feet, and said, ‘Your Majesty, this is not a painting but a polished wall.’

source: །དེ་ནས་རྒྱལ་པོ་ཇེ་ཡ་མཚན་སྐྱེས་ནས་སྨྲས་པ། འདི་ནི་བཟོ་ལ་ལྷག་པར་མཁས་པ་ཡིན་ནོ།
en: “Then the king declared with further astonishment, ‘This one is much more skilled in art.’

source: གང་གིས་ཟླ་བ་དྲུག་ཏུ་རྩིག་ངོས་བསྟར་བ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་ཉིད་ཡིན་ནོ།
en: The one who just polished the wall for six months was indeed this monk Śāriputra.

source: །གང་གིས་ཟླ་བ་དྲུག་ཏུ་རི་མོའི་ལས་བྱས་པ་དེ་ནི་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་མཽད་གལ་གྱི་བུ་འདི་ཉིད་དེ་ཡིན་ཏེ།
en: The one who painted for six months at that time, on that occasion, was indeed this monk Maudgalyāyana.

source: དེ་ན་ཡང་འདིས་འདི་བཟོས་ཕམ་པར་བྱས་སོ།
en: At that time, he (Śāriputra) defeated him (Maudgalyāyana) with his art.

source: །གཞན་ཡང་ཇི་ལྟར་འདིས་འདི་ཕམ་པར་བྱས་པ་དེ་ཉོན་ཅིག །དགེ་སློང་དག་སྔོན་བྱུང་བ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ན་དྲང་སྲོང་དུང་དང་། བྲིས་པ་ཞེས་བྱ་བ་གཉིས་ཤིག་ཉེ་བར་རྟེན་ཅིང་གནས་སོ།
en: “Listen, again, to how he defeated him. “Monks, once there lived two ṛṣis named Śaṅkha and Likhita near the city of Vārāṇasī.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་ལྷས་ཆར་ཕབ་པས་རྫབ་ཏུ་གྱུར་ཏེ།
en: One day, a god brought rain and the ground became muddy.

source: དུང་དྲེད་དེ་རྫབ་ཏུ་རྡེག་འཆོས་ནས་རིལ་བ་ཆག་པར་གྱུར་ཏོ།
en: Śaṅkha slipped and fell in the mud, and his water jar broke.

source: །དེ་ནས་དེས་དམོད་པ་བོར་བ།
en: He then put a curse on the god:

source: རང་བཞིན་ངན་པ་ཁྱོད་ཀྱིས་ད་ཕན་ཆད་ལོ་བཅུ་གཉིས་སུ་ཆར་མི་འབེབས་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: ‘Wicked one, may you not bring rain for twelve years from today onward!’

source: །རྒྱལ་པོ་ཚངས་སྦྱིན་དང་བཱ་རཱ་ཎ་སཱི་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཀྱིས་ཐོས་ནས། དེ་ནས་དེ་རྣམས་དེའི་དྲུང་དུ་སོང་སྟེ་གསོལ་བ་བཏབ་པ། དྲང་སྲོང་ཆེན་པོ་དེ་ལྟར་མ་མཛད་ཅིག །དེས་སྨྲས་པ།
en: “Having heard about this, King Brahmadatta and the people dwelling in Vārāṇasī went to him and requested, ‘O great ṛṣi, do not do that.’

source: བདག་གིས་རང་བཞིན་ངན་པ་བཟོད་པར་མི་ནུས་ཏེ།
en: “ ‘I cannot forgive the wicked one,’ he replied.

source: བདག་གི་དམོད་པས་བཅོམ་པ་དེས་ལོ་བཅུ་གཉིས་སུ་ཆར་མི་འབེབས་པར་འགྱུར་རོ།
en: ‘Subdued by my curse, he will not bring rain for twelve years.’

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་དང་། སྐྱེ་བོའི་ཚོགས་དེས་བྲིས་པ་ལ་གསོལ་བ་བཏབ་ནས་དེས་གསོལ་བ་བྱས་ཏེ་ལྷས་ཆར་ཕབ་བོ།
en: “King Brahmadatta and the people then requested help from Likhita. He prayed, and the god brought rain.

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་དྲང་སྲོང་དུང་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་མཽད་གལ་གྱི་བུ་འདི་ཉིད་ཡིན་ནོ།
en: The ṛṣi Śaṅkha at that time, on that occasion, was indeed this monk Maudgalyāyana.

source: །དེའི་ཚེ་དེའི་དུས་ཀྱི་བྲིས་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་ཡིན་ཏེ།
en: The ṛṣi Likhita at that time, on that occasion, was indeed this monk Śāriputra.

source: དེ་ན་ཡང་འདིས་འདི་རྫུ་འཕྲུལ་གྱིས་ཕམ་པར་བྱས་སོ།
en: At that time, too, he defeated him with his magical power.” 5. A Story of the Past: The Ṛṣis Śaṅkha and Likhita (2)

source: །གཞན་ཡང་ཇི་ལྟར་འདིས་འདི་རྫུ་འཕྲུལ་གྱིས་ཕམ་པར་བྱས་པ་དེ་ཉོན་ཅིག །བྲིས་པས་དགོས་པ་འགའ་ཞིག་གི་ཕྱིར་དུང་གི་རྐང་པ་གཉིས་ལ་གཏུགས་པ་ལས་དུང་གི་རྐང་པ་གཉིས་ཀྱིས་རལ་པ་མནན་པ་དང་བྲིས་པས་སྨྲས་པ།
en: “Listen, again, to how he defeated him with his magical power. “When Likhita threw himself at Śaṅkha’s feet for some reason, Śaṅkha trod on the locks of his hair.

source: ཉི་མ་འཆར་ཀའི་དུས་ཀྱི་ཚེ་ཁྱོད་ཀྱི་སྤྱི་བོ་གས་པར་གྱུར་ཅིག །དུང་གིས་སྨྲས་པ།
en: Likhita cursed him: ‘May your head split when the sun rises!’

source: དེ་ལྟར་ན་ཉི་མ་འཆར་བར་མ་གྱུར་ཅིག་ཅེས་བྱས་པ་དང་། འཇིག་རྟེན་དུ་ནམ་སྲོས་པར་གྱུར་ཏོ།
en: “Śaṅkha retorted, ‘If so, may the sun not rise!’ “The world was then covered in darkness.

source: །དེ་ནས་རྒྱལ་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་གིས་དུང་ལ་གསོལ་བ་བཏབ་པ། དྲང་སྲོང་ཆེན་པོ་དེ་ལྟ་བུ་མ་མཛད་ཅིག །དེས་སྨྲས་པ།
en: Thus, the king, brahmins, and householders requested Śaṅkha, ‘O great ṛṣi, please do not do this.’

source: ཉི་མ་ཤར་བར་གྱུར་ན་གདོན་མི་ཟ་བར་བདག་གི་མགོ་འགས་པར་འགྱུར་རོ། །བྲིས་པས་དེ་ལ་སྨྲས་པ།
en: “He replied, ‘If the sun rises, my head will certainly split.’

source: གལ་ཏེ་དེ་ལྟ་ན་འཇི་པ་ལས་བྱས་པའི་མགོ་ཞིག་བྱོས་ཤིག །ཇི་ཙམ་ན་འཇི་བ་ལས་དུང་གི་མགོ་ཞིག་བྱས་པ་ལས་ཉི་མ་ཤར་བ་དང་གས་པར་གྱུར་ཏོ།
en: “ ‘If that’s the case, make a head out of clay,’ said Likhita. “When a replica of Śaṅkha’s head had been made out of clay, the sun rose, and the head split.

source: དུང་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་མཽད་གལ་གྱི་བུ་འདི་ཉིད་དེ་ཡིན་ནོ།
en: Śaṅkha was indeed this monk Maudgalyāyana.

source: །བྲིས་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་ཉིད་དེ་ཡིན་ཏེ། དེ་ན་ཡང་འདིས་ཕམ་པར་བྱས་སོ།
en: Likhita was indeed this monk Śāriputra. At that time, too, he defeated him.” 6. A Story of the Past: The Ivory Carver and the Painter

source: །གཞན་ཡང་ཇི་ལྟར་ཕམ་པར་བྱས་པ་དེ་ཉོན་ཅིག །ཡུལ་དབུས་སུ་བ་སོ་མཁན་གྱི་སློབ་དཔོན་ཞིག་བྱུང་ནས་བ་སོ་འབྲས་ཙམ་བྲེའུ་ཆུང་གང་ཁྱེར་ནས་ཡུལ་ནས་ཅན་དུ་སོང་སྟེ།
en: “Listen, again, to how he defeated him. “A certain ivory carver went from the midland region to the region of Yavana, bringing one prastha of ivory rice grains.

source: དེ་རི་མོ་མཁན་གྱི་སློབ་དཔོན་ཞིག་གི་ཁྱིམ་དུ་ཞུགས་ན་དེ་ཡང་སྟོང་པར་འདུག་ནས་དེའི་ཆུང་མ་ལ་སྨྲས་པ།
en: He entered the house of a painter, but the painter was away.

source: གྲོགས་པོའི་ཆུང་མ་འབྲས་བྲེའུ་ཆུང་གང་པོ་འདི་ཚོས་ལ་བྱིན་ཅིག་ཅེས་དེ་བཞག་སྟེ་སོང་ངོ་།
en: He said to the painter’s wife, ‘Wife of my friend, please cook this prastha of rice and give it.’ He put the rice grains there and left.

source: །དེས་བཙོ་བར་བརྩམས་པ་ལས་ཤིང་ཟད་པར་གྱུར་ཀྱང་མ་ཚོས་སོ།
en: “She then set them to cook, but they were still not done even after all the firewood was exhausted.

source: །དེ་ནས་དེའི་ཁྱིམ་ཐབ་འོངས་ནས་སྨྲས་པ། བཟང་མོ་འདི་ཅི་ཞིག་ཡིན།
en: When her husband came back home, he asked her, ‘Good lady, what is this?’

source: དེས་རྒྱས་པར་སྨྲས་པ་དང་། དེས་དེ་བརྟགས་པ་ལས་བ་སོ་འབྲས་ཙམ་ཤེ་དག་ཏུ་མཐོང་ནས་དེས་དེ་ལ་ཅོ་དྲི་བར་སྨྲས་པ།
en: “She explained everything in detail. He examined the rice grains and realized that they were made of ivory.

source: བཟང་མོ་འདི་ཚྭ་ཆུ་ཡིན་གྱིས།
en: He scolded his wife and said, ‘Good lady, this is salty water.

source: ཆུ་བཟང་པོ་གཞན་ཞིག་ཁྱེར་ཏེ་འོངས་དང་། དེས་འབྲས་འདི་ཚོས་པར་འགྱུར་རོ།
en: Bring some different, better water and this rice will get done with that.’

source: །དེས་བ་སོ་མཁན་གྱི་སློབ་དཔོན་ལ་ཆུ་བཟང་པོ་ཞིག་ཁྱེར་ཏེ་ཤོག་ཤིག་ཅེས་སྨྲས་སོ།
en: “She asked the ivory carver, ‘Please bring some better water.’

source: །དེས་དེ་ལ་སྨྲས་ནས། དེས་ཕྱོགས་གཞན་ཞིག་ཏུ་རྫིང་བུ་ཞིག་བྲིས་ཏེ། དེར་ཁྱི་རོ་བམ་བ་ཞིག་ཀྱང་བྲིས་སོ།
en: “The painter, having thus instructed her, painted a pond in a certain place and also painted a dead dog there.

source: །དེ་ནས་བ་སོ་མཁན་གྱི་སློབ་དཔོན་དེ་བུམ་པ་ཁྱེར་ནས་རྫིང་བུ་ཡིན་ནོ་སྙམ་ནས་ཕྱོགས་དེར་ཕྱིན་ཏེ།
en: Then the ivory carver brought a water jar.

source: ཁྱི་རོ་བམ་པ་མཐོང་བ་དང་། དེས་སྣ་བཀབ་ནས་བརྟག་པར་བརྩམས་པ་ལས་ཇི་ཙམ་ན་དེའི་ཆུ་སྣོད་དེ་ཆག་ནས་བ་སོ་མཁན་གྱི་སློབ་དཔོན་དེ་སྐྱེངས་པར་གྱུར་ཏོ།
en: Believing that it was a pond, he arrived at that place and saw the dead dog. When he began to examine it, covering his nose, his water jar fell and broke. The ivory carver felt ashamed.

source: བ་སོ་མཁན་གྱི་སློབ་དཔོན་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་མཽད་གལ་གྱི་བུ་འདི་ཉིད་དེ་ཡིན་ནོ།
en: The ivory carver at that time, on that occasion, was indeed this monk Maudgalyāyana.

source: །རི་མོ་མཁན་གྱི་སློབ་དཔོན་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་ཉིད་དེ་ཡིན་ནོ།
en: The painter at that time, on that occasion, was indeed this monk Śāriputra.

source: །འོན་ཀྱང་དེ་བཞིན་གཤེགས་པས་བརྙེས་པའི་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་གང་དག་ཡིན་པ་དེ་དག་གི་མིང་ཡང་རང་སངས་རྒྱས་རྣམས་ཀྱིས་མི་ཤེས་སོ།
en: However, self-awakened ones do not know even the names of the dhyāna, samādhi, and samāpatti that the Tathāgata has attained.

source: །རང་སངས་རྒྱས་རྣམས་ཀྱིས་ཐོབ་པ་གང་དག་ཡིན་པ་དེ་དག་གི་མིང་ཡང་དགེ་སློང་ཤཱ་རིའི་བུས་མི་ཤེས་སོ།
en: The monk Śāriputra does not know even the names of what self-awakened ones have attained.

source: །དགེ་སློང་ཤཱ་རིའི་བུས་ཐོབ་པ་གང་དག་ཡིན་པ་དེ་དག་གི་མིང་ཡང་དགེ་སློང་མཽད་གལ་གྱི་བུས་མི་ཤེས་སོ།
en: The monk Maudgalyāyana does not know even the names of what the monk Śāriputra has attained.

source: །དགེ་སློང་མཽད་གལ་གྱི་བུས་ཐོབ་པ་གང་ཡིན་པ་དེ་དག་གི་མིང་ཡང་ཉན་ཐོས་གཞན་རྣམས་ཀྱིས་མི་ཤེས་ཏེ། །དགེ་སློང་མཽད་གལ་གྱི་བུ་བས་དགེ་སློང་ཤཱ་རིའི་བུ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་མོད་ཀྱི། དེས་མང་དུ་གནས་པ་ལ་དགོངས་ནས་ངས་རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ།
en: Other disciples do not know even the names of what the monk Maudgalyāyana has attained. Although the monk Śāriputra possesses greater magical power and greater dignity than the monk Maudgalyāyana, I praised Maudgalyāyana as the best of those who possess magical power, implying that he has exercised it many times.”

source: །ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུའི་ལེའུའོ།། །།
en: Here ends the Section of Śāriputra and Maudgalyāyana. C. Verses of the Elders I 1. Kāśyapa

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་པར་བྱེད་དེ། སྨྲས་པ།
en: Thereupon the venerable Mahākāśyapa explained his karmic bond. The following was spoken:

source: དེ་ནི་དེར་སོང་སྔོན་ནས་སྤྱད་པ་དང་། །རྗེས་མཐུན་ཚིག་དག་ཤིན་ཏུ་སྒྲོགས་པ་ན།
en: When he went there and spoke words That were suited to what he had done in the past,

source: །གང་ཞིག་བྱས་པས་འབྲས་བུ་ཆེ་མྱོང་བ། །ཆུང་ངུ་གཅིག་པུ་དེ་ནི་མྱུར་དྲན་ནས།
en: Having quickly remembered the small acts Because of which he enjoyed great fruits,

source: །ཇི་ལྟར་སེང་གེ་རི་ཡི་ཕུག་གནས་པ།
en: Just as a lion dwelling in a mountain cave

source: །འཇིགས་པ་མེད་པར་སྤྱོད་ཡུལ་འགྲོ་བ་ལྟར།
en: Walks around his territory without fear,

source: །མཚུངས་པ་མེད་པའི་ཉན་ཐོས་འོད་སྲུང་དེ།
en: The incomparable disciple Kāśyapa

source: །སྔོན་གྱི་གནས་ནས་སྤྱད་པ་སྒྲོགས་བྱེད་པ།
en: Related what he had done in his past lives: “Believing that the supreme Dharma lay

source: །ཟག་མེད་ཐ་བ་མེད་པ་རྣམ་གྲོལ་སེམས།
en: In an untainted one who was free from turbidity, whose mind was completely liberated,

source: །ཉོན་མོངས་མེད་པར་གནས་པ་སྐྱོན་མེད་ཡིད། །དེ་ལ་ཆོས་མཆོག་ཡོད་པར་ཡིད་ཆེས་ནས།
en: Who dwelled without defilements, whose mind was free from faults,

source: །དེ་ཡི་ཆོས་ལ་ཡིད་ཀྱིས་སྨོན་བྱས་ཏེ།
en: I made a wish in my heart regarding his Dharma. “Since I had given one prastha of millet in alms

source: །རང་སངས་རྒྱས་ལ་བདག་གིས་ཡོན་དུ་ནི། །ཁྲེ་རྒོད་བྲེའུ་ཆུང་གང་ཞིག་རབ་ཕུལ་བས།
en: To the Self-Awakened One

source: །དེ་འདྲ་བ་དང་ཀུན་དུ་ཕྲད་གྱུར་ཅེས།
en: And wished that I would meet his equal,

source: །སྨོན་པས་སྒྲ་མི་སྙན་དུ་སྐྱེས་པ་ནི།
en: I was reborn on the continent of Kuru.

source: །ལས་དེ་གཅིག་པུ་ཉིད་ཀྱི་འབྲས་བུ་ཡིས།
en: “Through the fruit of that mere act,

source: །ལུས་ཅན་བདག་གིར་འཛིན་མེད་ཚེ་རིང་བ།
en: Having a body, not attached to things as ‘mine,’ endowed with long life,

source: །ཁྱད་པར་འགྲོ་ཞིང་སྤྱོད་པ་མི་དམན་པ།
en: Being eminent and of superior deeds,

source: །སྒྲ་མི་སྙན་དུ་ལན་སྟོང་སྐྱེས་པར་གྱུར།
en: I was reborn in Kuru a thousand times.

source: །ལན་སྟོང་སུམ་བཅུ་རྩ་གསུམ་པར་སྐྱེས་ཏེ།
en: I was reborn among the Thirty-Three Gods a thousand times,

source: །མེ་ཏོག་ཕྲེང་རྒྱན་བྱུག་པ་སྣ་ཚོགས་དང་། །མཐུ་ཆེན་ལུས་མཛེས་པ་དང་ལྡན་པར་གྱུར།
en: Possessed of garlands of flowers, accessories, various perfumes, Great power, and beautiful bodies.

source: །དེ་ནས་འཕོས་བདག་སྒྲ་མི་སྙན་དུ་སྐྱེས།
en: “Having died there, I was born in Kuru,

source: །སླར་ཡང་ལྷ་དགེ་དགའ་བར་བྱེད་པ་དང་། །སེམས་ཀྱི་སྨོན་ལམ་དབང་གིས་སླར་ཡང་བདག །མི་ནི་དགེ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས།
en: And then again enjoyed myself among the good gods. By the power of a mental aspiration, I was then born again among good humans.

source: །ལས་དེ་གཅིག་པུ་ཉིད་ཀྱི་འབྲས་བུས་བདག །བྲམ་ཟེ་སཱ་ལ་ཆེན་པོའི་རིགས་སྐྱེས་ཏེ།
en: “Through the fruit of that mere act, I was born into a very wealthy brahmin family.

source: །ནོར་མང་སྐྱེས་པ་བུད་མེད་རྣམས་ཀྱིས་བཀུར།
en: Born rich, attended by men and women,

source: །འདོད་པའི་ཡོན་ཏན་ལྔ་དོན་མི་གཉེར་ཡང་།
en: Still I did not seek the five objects of desire.

source: །བདག་གིས་སྟོན་པ་ལན་འགའང་མ་མཐོང་ཞིང་།
en: “Not having met the Teacher

source: །མཚུངས་མེད་ཉན་ཐོས་བདག་གིས་མ་མཐོང་ནས།
en: Nor the incomparable disciples,

source: །བདག་གི་སེང་རས་ཚེམ་གྱོན་འཇིག་རྟེན་ན།
en: I bowed respectfully to arhats in patched robes,

source: །དགྲ་བཅོམ་རྣམས་ལ་ཕྱག་འཚལ་རབ་ཏུ་བྱུང་།
en: Who were venerated in the world, and went forth.

source: །བདག་ནི་དེ་ལྟར་རབ་ཏུ་བྱུང་བ་དང་། །རྒྱལ་བ་བུ་མངས་མཆོད་རྟེན་ན་བཞུགས་མཐོང་།
en: “When I had thus gone forth, I saw the Victor sitting in the Bahuputra shrine.

source: །ཐུབ་ཞབས་ཕྱག་འཚལ་བཅོམ་ལྡན་བདག་གི་སྟོན།
en: I bowed to the Muni’s feet and said,

source: །བདག་ནི་ཁྱོད་ཀྱི་ཉན་ཐོས་གྱུར་ཅེས་གསོལ།
en: ‘O Blessed One, my teacher, I am your disciple.’

source: །འོད་སྲུང་ཇི་སྐད་སྨྲས་བཞིན་བྱས་ཏེ་འདིར།
en: “He said, ‘Kāśyapa, as you said,

source: །ཁྱོད་སྟོན་ང་ཡིན་ང་ཡི་ཉན་ཐོས་ཁྱོད།
en: I am your teacher, and you are my disciple.

source: །གལ་ཏེ་སྡུག་བསྔལ་ཀུན་ལས་ཐར་འདོད་ན།
en: If you desire to be liberated from all suffering,

source: །ཁྱོད་ཀྱིས་སྙན་པར་བཤད་པའི་ཆོས་སྙན་ཉོན།
en: You should listen to the sweet Dharma, which is sweetly taught.’

source: །གང་ཡང་བདག་ལ་སྐྱེས་མཆོག་སྐྱོབ་པ་ནི།
en: “The best of humans, the Protector,

source: །ཐུགས་རྗེ་ཆེན་པོ་ཡིས་ནི་ཆོས་བཤད་པ།
en: The one who possesses great compassion, taught me the Dharma

source: །བསམ་གཏན་བཞི་སྟོབས་དབང་པོ་བྱང་ཆུབ་ཀྱི།
en: Concerning the four dhyānas, the powers, the faculties,

source: །ཡན་ལག་ལམ་གྱི་ཡན་ལག་རྣམ་པར་ཐར།
en: The limbs of awakening, the limbs of the path, and liberation.

source: །དེ་དག་བསྒོམ་པ་བདག་གིས་དགའ་མགུར་ཐོབ།
en: “I succeeded in meditating on them with joy.

source: །ཟག་པ་ཟད་ཅིང་ལུས་ཀྱི་ཐ་མ་བཟུང་།
en: I have exhausted impurity and bear my final body.

source: །ལུས་ཀྱི་ཐ་མ་འཛིན་པ་རྡུལ་མེད་པ། །དྲང་པོ་འདི་དག་དང་ནི་བདག་གིར་ཕྲད།
en: I met these straightforward ones, Who bear their final bodies and are taintless.

source: །དེ་བཞིན་གཤེགས་རྒྱལ་ཕུན་སུམ་ཚོགས་པ་གསུང་།
en: “The Tathāgata, the Victor, speaks what is perfect.

source: །ཚུལ་ཁྲིམས་ལྡན་པ་གང་འདོད་འགྲུབ་པར་འགྱུར།
en: The wish of those who keep to good conduct will be fulfilled.

source: །བདག་གི་ཡིད་ལ་ཅི་དང་ཅི་བསམས་པ།
en: Everything I thought in my mind

source: །ཐམས་ཅད་གྲུབ་སྟེ་སྲིད་པའི་ཐ་མ་འདི།
en: Was fulfilled. This is the end of my existence.

source: །བདག་གི་སྐྱེ་བ་ཟད་ཅིང་འཆིང་བ་དང་། །སྲིད་པ་ཀུན་ནས་ལངས་པ་ཉིད་བཅད་དེ།
en: “My births have been exhausted. The bonds And thirst that had risen from everywhere were destroyed.

source: །བདག་ནི་ཆོས་རྒྱལ་ཐུགས་ལས་སྐྱེས་པའི་སྲས།
en: I am a son born from the heart of the Dharma King.

source: །ཉོན་མོངས་ཚོགས་རྣམས་ཟད་པས་མྱ་ངན་འདའ།
en: I will be completely emancipated because my mass of defilements is exhausted.

source: །བདག་ནི་ཐམས་ཅད་གཟིགས་པ་ཡིས།
en: “The All-Seeing One has praised me

source: །སྦྱངས་ལ་གནས་པ་མཆོག་ཏུ་བསྟན།
en: As the best of those who practice austerities.

source: །ཟག་པ་མེད་ཅིང་ཉེས་པ་བསལ།
en: Being untainted and free from faults,

source: །གོ་འཕང་མི་གཡོ་བདག་གིས་འཐོབ།
en: I attained the immovable state.”

source: །གནས་བརྟན་འོད་སྲུང་དེ་ལྟ་བུར།
en: Thus the Elder Kāśyapa Explained his karma, Seated before the community of monks

source: །མ་དྲོས་པ་ཡི་མཚོ་ཆེན་དུ། །དགེ་སློང་དགེ་འདུན་མདུན་འདུག་ནས། །རང་གི་ལས་ནི་ལུང་བསྟན་ཏོ།
en: On the great lake Anavatapta.

source: །འོད་སྲུང་གི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: Here ends the first section:

source: འདུལ་བ་གཞི། བམ་པོ་ལྔ་བཅུ་རྩ་གཉིས་པ།
en: The Section of Kāśyapa. 2.

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལས་ཅི་ཞིག་བྱས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཤེས་རབ་ཆེན་པོ་དང་སྤོབས་པ་ཆེན་པོ་དང་ལྡན་པར་གྱུར་དེས་སྨྲས་པ།
en: Śāriputra Thereupon the monks who were the most venerable of the elders asked the venerable Śāriputra, “What karma did the venerable Śāriputra create that matured to cause his great wisdom and great eloquence?” He said:

source: བདག་གིས་དགོན་པར་རང་སངས་རྒྱས།
en: “In the wilderness, I saw a self-awakened one—

source: །དྲང་སྲོང་དགེ་སྦྱོང་ཞིར་གྱུར་པ།
en: A ṛṣi, a śramaṇa,

source: །སྐལ་དང་ལྡན་པ་ཆོས་གོས་ནི།
en: A tranquil one, a fortunate one—

source: །དེ་ཚེ་རྙིང་པ་གྱོན་པ་མཐོང་།
en: Wearing at that time a worn-out robe.

source: །དེ་ལ་བདག་གིས་སེམས་དད་པས། །བང་བརྒྱུགས་ནས་ཀྱང་ཆོས་གོས་ནི། །དྲུབས་ཤིང་ཁ་བསྒྱུར་དེ་བཞིན་དུ།
en: “My mind filled with faith in him, I washed, sewed, And dyed his robe.

source: །དེ་ལ་ཡང་དང་ཡང་དུ་གཏུགས།
en: Thus, I frequently approached him.

source: །དེ་ནས་བདག་ལ་ཐུགས་བརྩེའི་ཕྱིར།
en: “Thereupon, out of compassion for me,

source: །དེ་ནི་བར་སྣང་ལ་འཕགས་ནས།
en: He soared up into the sky.

source: །རང་གི་གཟི་བརྗིད་ཀྱིས་འབར་ཞིང་།
en: Blazing with his own radiance,

source: །དེ་ནས་མཁའ་ལ་གཤེགས་པར་གྱུར།
en: He flew through the air.

source: །བདག་གིས་ཐལ་མོ་སྦྱར་བྱས་ནས།
en: “Making the gesture of supplication, I formed an aspiration:

source: །ཇི་ལྟར་བདག་ནི་འདི་འདྲ་བར།
en: ‘May I possess

source: །དབང་རྣོན་ཤེས་རབ་ཆེར་ཤོག་ཅེས། །དེ་ལྟ་བུར་ནི་སྨོན་ལམ་བཏབ།
en: Such keen faculties and great wisdom!

source: །བདག་ནི་ཕྱུག་པོའི་རིགས་སུའམ།
en: “ ‘May I be born neither into a wealthy family

source: །མ་རབས་དག་ཏུ་མི་སྐྱེ་བར།
en: Nor among lowly ones

source: །བར་མའི་རིགས་སུ་སྐྱེ་འགྱུར་ཞིང་།
en: But into a middle-rank family

source: །རྟག་ཏུ་རབ་འབྱུང་མང་བར་ཤོག །དགེ་བའི་རྩ་བ་དེས་ན་བདག །བདག་ནི་ཚེ་རབས་ལྔ་བརྒྱར་ཡང་།
en: And go forth again and again!’ “By this root of merit, Throughout five hundred lives

source: །མི་ཡི་རྙེད་པ་ཐོབ་ནས་ནི།
en: I attained a human birth

source: །བདག་གི་སྐྱེ་བ་ཐ་མ་ནི།
en: “My final birth is

source: །མི་ཡི་སྲིད་ཐོབ་འདི་ཡིན་ཏེ།
en: This human life I have attained. “I have pleased this caravan leader,

source: །རྫོགས་སངས་བླ་ན་མེད་པ་ཡི།
en: The Supremely, Completely Awakened One.

source: །དེད་དཔོན་འདི་ནི་མཉེས་པར་བྱས།
en: Having succeeded in going forth

source: །ཤཱཀྱ་སེང་གེའི་བསྟན་པ་ལ།
en: In the teachings of the Lion of the Śākyans,

source: །བདག་གིས་རབ་བྱུང་ཐོབ་ནས་ནི། །མྱ་ངན་འདས་པ་བསིལ་གྱུར་པའི།
en: “I attained nirvāṇa,

source: །དགྲ་བཅོམ་པ་ཡང་བདག་གིས་ཐོབ།
en: The peaceful state of an arhat.

source: །བཙུན་པ་བདག་གིས་ཟླ་ཕྱེད་ཀྱིས། །འགྲོ་བའི་ཕ་རོལ་ཕྱིན་པ་ཐོབ།
en: O honored ones, I succeeded in reaching The end of existence in half a month.

source: །དགེ་སློང་དགེ་འདུན་གུད་བཞུགས་ནས།
en: “Sitting before the community of monks,

source: །སྟོན་པས་བདག་ནི་མངོན་སུམ་དུ།
en: The Teacher praised me

source: །ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་སྐོར་བ།
en: As the turner of the wheel of the Dharma,

source: །ཤེས་རབ་ཅན་གྱི་གཙོ་བོར་བསྟན།
en: The best of those who possess wisdom.”

source: །ཤེས་རབ་ཆེན་པོ་ཤཱ་རིའི་བུ།
en: Thus Śāriputra, who is of great wisdom, Explained his karma,

source: །དགེ་སློང་དགེ་འདུན་མདུན་འདུག་ནས།
en: Seated before the community of monks

source: །མ་དྲོས་པ་ཡི་མཚོ་ཆེན་དུ། །རང་གི་ལས་ནི་ལུང་བསྟན་ཏོ།
en: On the great lake Anavatapta.

source: །ཤཱ་རིའི་བུའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།
en: Here ends the second section: The Section of Śāriputra. 3. Maudgalyāyana

source: དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ནི་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ཟིན་གྱིས།
en: Thereupon the monks who were the most venerable of the elders requested the venerable Mahā­maudgalyāyana, “O Venerable Mahā­maudgalyāyana, the venerable Śāriputra has explained his karmic bond.

source: ད་ནི་ཁྱོད་ཀྱིས་ཀྱང་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་སྟོན་ཅིག །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Now you, too, should explain your karmic bond.” Thus requested, the venerable Mahā­maudgalyāyana said to the monks who were the most venerable of the elders:

source: །བདག་སྔོན་དྲང་སྲོང་གྱུར་པའི་ཚེ།
en: “When I was once a ṛṣi

source: །ནགས་མཐའི་དགོན་པར་གནས་པ་ན།
en: Living in a forest,

source: །དེར་ནི་སྐྱེས་པ་ཞིག་འོངས་ནས།
en: A man came there

source: །བདག་ལ་རབ་བྱུང་གསོལ་བ་འདེབས།
en: And asked me to let him go forth.

source: །བདག་གིས་བརྒྱུགས་ནས་དེ་ཡི་སྐྲ།
en: “I shaved his hair,

source: །བྲེགས་ནས་ཀྱང་ནི་ཆོས་གོས་དག །ཁ་དོག་བསྒྱུར་ནས་དེ་ལ་བྱིན།
en: Washed and dyed his robe, And gave it to him.

source: །དེ་ཡིད་དགའ་གྱུར་དེ་ཡི་ཚེ།
en: Then he was pleased.

source: །ཕྱོགས་གཅིག་ཏུ་ནི་ཉེར་སོང་ནས།
en: “Having gone to one side,

source: །སྐྱིལ་མོ་ཀྲུང་བཅས་འདུག་ནས་དེས།
en: He sat down with his legs crossed

source: །རང་བྱང་ཆུབ་ནི་རེག་གྱུར་ཏེ།
en: And attained the state of a self-awakened one.

source: །དེ་ནས་མཁའ་ལ་སོང་བར་གྱུར།
en: Thereupon he flew away through the air.

source: །བདག་གིས་དད་བསྐྱེད་ཉེར་སོང་ནས།
en: “Having acquired faith,

source: །དེ་ནས་ཐལ་མོ་ལེགས་སྦྱར་ཏེ།
en: I respectfully made the gesture of supplication.

source: །དེ་ན་རྫུ་འཕྲུལ་མཆོག་གསོལ་ཞིང་། །སྨོན་ལམ་གདབ་པ་བྱས་པ་ནི། །དྲང་སྲོང་ཆེ་འདི་ཅི་འདྲ་བའི།
en: Requesting the best magical power, Right there I made an aspiration:

source: །བདག་གི་རྫུ་འཕྲུལ་དེ་འདྲར་ཤོག །དགེ་བའི་རྩ་བ་དེ་ཡིས་ན།
en: “ ‘May my magical power Be equal to this great ṛṣi’s!’ “By this root of merit,

source: །གང་དང་གང་དུ་སྐྱེས་པར་ནི།
en: Wherever I was born,

source: །བསོད་ནམས་བྱས་པས་མཛེས་པ་ཡི།
en: Having made merit,

source: །ལྷ་དང་མི་ནི་རྣམས་སུ་གྱུར།
en: I dwelt among beautiful gods and humans.

source: །བདག་གི་སྲིད་པ་ཐ་མ་ནི།
en: “My final birth is

source: །དགྲ་བཅོམ་པ་ནི་བདག་གིས་ཐོབ།
en: The peaceful state of an arhat.

source: །ཐམས་ཅད་གཟིགས་པས་རྫུ་འཕྲུལ་ཅན།
en: “The All-Seeing One has praised me

source: །རྣམས་ཀྱི་མཆོག་ཏུ་བདག་བསྟན་ཏོ།
en: As the best of those who possess magical power.

source: །དགེ་བ་ཆུང་ངུ་བྱས་པ་ནི།
en: By doing a little good,

source: །བདེ་བ་མང་པོ་ཉམས་སུ་མྱོང་།
en: I experienced much happiness. “I will also explain

source: །མི་དགེ་བ་ཡི་ལས་གང་ཡིན།
en: My unwholesome karma;

source: །བདག་གིས་ལུང་བསྟན་མཉན་པར་གྱིས།
en: listen to it.
